---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsConnectionChangedWarning
source: html/4b37f3e9-389e-80fe-f5ed-17eee369a5ca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationRodsConnectionChangedWarning Property

The structural component that the hanger is attached to has changed to a different element.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationRodsConnectionChangedWarning { get; }
```